RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/**
  ******************************************************************************
  * @file    dsp2_middle5_reg.h
  * @version V1.2
  * @date    2021-07-15
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DSP2_MIDDLE5_REG_H__
#define __DSP2_MIDDLE5_REG_H__

#include "bl808.h"

/* 0x000 : awb3_config_0 */
#define DSP2_MIDDLE5_AWB3_CONFIG_0_OFFSET     (0x000)
#define DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE      DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE
#define DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE_LEN  (11U)
#define DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE_POS)
#define DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_X_MAX_PRE_POS))
#define DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE      DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE
#define DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE_LEN  (11U)
#define DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_X_MIN_PRE_POS))
#define DSP2_MIDDLE5_AWB3_STAT_EN_PRE         DSP2_MIDDLE5_AWB3_STAT_EN_PRE
#define DSP2_MIDDLE5_AWB3_STAT_EN_PRE_POS     (31U)
#define DSP2_MIDDLE5_AWB3_STAT_EN_PRE_LEN     (1U)
#define DSP2_MIDDLE5_AWB3_STAT_EN_PRE_MSK     (((1U << DSP2_MIDDLE5_AWB3_STAT_EN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_EN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_STAT_EN_PRE_UMSK    (~(((1U << DSP2_MIDDLE5_AWB3_STAT_EN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_EN_PRE_POS))

/* 0x004 : awb3_config_1 */
#define DSP2_MIDDLE5_AWB3_CONFIG_1_OFFSET     (0x004)
#define DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE      DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE
#define DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE_LEN  (11U)
#define DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE_POS)
#define DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_Y_MAX_PRE_POS))
#define DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE      DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE
#define DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE_LEN  (11U)
#define DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_STAT_Y_MIN_PRE_POS))

/* 0x008 : awb3_config_2 */
#define DSP2_MIDDLE5_AWB3_CONFIG_2_OFFSET       (0x008)
#define DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE      DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE
#define DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE_LEN  (12U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_OFST_PRE_POS))
#define DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE      DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE
#define DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE_LEN  (12U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_OFST_PRE_POS))
#define DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE         DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE
#define DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE_POS     (31U)
#define DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE_LEN     (1U)
#define DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE_MSK     (((1U << DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE_POS)
#define DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE_UMSK    (~(((1U << DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_DIVISOR_PRE_POS))

/* 0x00C : awb3_config_3 */
#define DSP2_MIDDLE5_AWB3_CONFIG_3_OFFSET       (0x00C)
#define DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE      DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE
#define DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE_LEN  (12U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_MULT_PRE_POS))
#define DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE      DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE
#define DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE_LEN  (12U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_MULT_PRE_POS))

/* 0x010 : awb3_config_4 */
#define DSP2_MIDDLE5_AWB3_CONFIG_4_OFFSET        (0x010)
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE      DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE_LEN  (9U)
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE_POS)
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_RATIO_SUM_MAX_PRE_POS))
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE      DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE_POS  (9U)
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE_LEN  (9U)
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_RATIO_SUM_MIN_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE_POS  (18U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_GAIN_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE        DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE_POS    (26U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE_LEN    (1U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE_MSK    (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE_UMSK   (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_EN_PRE_POS))

/* 0x014 : awb3_config_5 */
#define DSP2_MIDDLE5_AWB3_CONFIG_5_OFFSET      (0x014)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_00_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_01_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_02_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_03_PRE_POS))

/* 0x018 : awb3_config_6 */
#define DSP2_MIDDLE5_AWB3_CONFIG_6_OFFSET      (0x018)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_04_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_05_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_06_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_07_PRE_POS))

/* 0x01C : awb3_config_7 */
#define DSP2_MIDDLE5_AWB3_CONFIG_7_OFFSET      (0x01C)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_08_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_10_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_11_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_12_PRE_POS))

/* 0x020 : awb3_config_8 */
#define DSP2_MIDDLE5_AWB3_CONFIG_8_OFFSET      (0x020)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_13_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_14_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_15_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_16_PRE_POS))

/* 0x024 : awb3_config_9 */
#define DSP2_MIDDLE5_AWB3_CONFIG_9_OFFSET      (0x024)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_17_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_18_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_20_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_21_PRE_POS))

/* 0x028 : awb3_config_10 */
#define DSP2_MIDDLE5_AWB3_CONFIG_10_OFFSET     (0x028)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_22_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_23_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_24_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_25_PRE_POS))

/* 0x02C : awb3_config_11 */
#define DSP2_MIDDLE5_AWB3_CONFIG_11_OFFSET     (0x02C)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_26_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_27_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_28_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_30_PRE_POS))

