RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x030 : awb3_config_12 */
#define DSP2_MIDDLE5_AWB3_CONFIG_12_OFFSET     (0x030)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_31_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_32_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_33_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_34_PRE_POS))

/* 0x034 : awb3_config_13 */
#define DSP2_MIDDLE5_AWB3_CONFIG_13_OFFSET     (0x034)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_35_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_36_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_37_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_38_PRE_POS))

/* 0x038 : awb3_config_14 */
#define DSP2_MIDDLE5_AWB3_CONFIG_14_OFFSET     (0x038)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_40_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_41_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_42_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_43_PRE_POS))

/* 0x03C : awb3_config_15 */
#define DSP2_MIDDLE5_AWB3_CONFIG_15_OFFSET     (0x03C)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_44_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_45_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_46_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_47_PRE_POS))

