RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x040 : awb3_config_16 */
#define DSP2_MIDDLE5_AWB3_CONFIG_16_OFFSET     (0x040)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_48_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_50_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_51_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_52_PRE_POS))

/* 0x044 : awb3_config_17 */
#define DSP2_MIDDLE5_AWB3_CONFIG_17_OFFSET     (0x044)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_53_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_54_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_55_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_56_PRE_POS))

/* 0x048 : awb3_config_18 */
#define DSP2_MIDDLE5_AWB3_CONFIG_18_OFFSET     (0x048)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_57_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_58_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_60_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_61_PRE_POS))

/* 0x04C : awb3_config_19 */
#define DSP2_MIDDLE5_AWB3_CONFIG_19_OFFSET     (0x04C)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_62_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_63_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_64_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_65_PRE_POS))

