RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x050 : awb3_config_20 */
#define DSP2_MIDDLE5_AWB3_CONFIG_20_OFFSET     (0x050)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_66_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_67_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_68_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_70_PRE_POS))

/* 0x054 : awb3_config_21 */
#define DSP2_MIDDLE5_AWB3_CONFIG_21_OFFSET     (0x054)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_71_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_72_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_73_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_74_PRE_POS))

/* 0x058 : awb3_config_22 */
#define DSP2_MIDDLE5_AWB3_CONFIG_22_OFFSET     (0x058)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_75_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_76_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_77_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_78_PRE_POS))

/* 0x05C : awb3_config_23 */
#define DSP2_MIDDLE5_AWB3_CONFIG_23_OFFSET     (0x05C)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_80_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_81_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_82_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_83_PRE_POS))

/* 0x060 : awb3_config_24 */
#define DSP2_MIDDLE5_AWB3_CONFIG_24_OFFSET     (0x060)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_84_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_85_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_86_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_87_PRE_POS))

/* 0x064 : awb3_config_25 */
#define DSP2_MIDDLE5_AWB3_CONFIG_25_OFFSET     (0x064)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE      DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE
#define DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_RATIO_88_PRE_POS))

/* 0x068 : awb3_config_26 */
#define DSP2_MIDDLE5_AWB3_CONFIG_26_OFFSET   (0x068)
#define DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE      DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE
#define DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE_LEN  (12U)
#define DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE_POS)
#define DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_Y_R_COEFF_PRE_POS))

/* 0x06C : awb3_config_27 */
#define DSP2_MIDDLE5_AWB3_CONFIG_27_OFFSET   (0x06C)
#define DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE      DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE
#define DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE_LEN  (12U)
#define DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE_POS)
#define DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_Y_G_COEFF_PRE_POS))

/* 0x070 : awb3_config_28 */
#define DSP2_MIDDLE5_AWB3_CONFIG_28_OFFSET   (0x070)
#define DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE      DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE
#define DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE_LEN  (12U)
#define DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE_POS)
#define DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_Y_B_COEFF_PRE_POS))

/* 0x074 : awb3_config_29 */
#define DSP2_MIDDLE5_AWB3_CONFIG_29_OFFSET    (0x074)
#define DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE       DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE_POS   (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE_LEN   (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE_MSK   (((1U << DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE_UMSK  (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_GAIN_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE         DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE_POS     (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE_LEN     (1U)
#define DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE_MSK     (((1U << DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE_UMSK    (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_EN_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE      DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE_POS  (12U)
#define DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE_LEN  (1U)
#define DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_USE_G_PRE_POS))

/* 0x078 : awb3_config_30 */
#define DSP2_MIDDLE5_AWB3_CONFIG_30_OFFSET (0x078)
#define DSP2_MIDDLE5_AWB3_WT_Y_00_PRE      DSP2_MIDDLE5_AWB3_WT_Y_00_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_00_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_00_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_00_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_00_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_00_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_00_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_00_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_00_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_01_PRE      DSP2_MIDDLE5_AWB3_WT_Y_01_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_01_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_01_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_01_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_01_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_01_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_01_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_01_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_01_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_02_PRE      DSP2_MIDDLE5_AWB3_WT_Y_02_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_02_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_02_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_02_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_02_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_02_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_02_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_02_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_02_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_03_PRE      DSP2_MIDDLE5_AWB3_WT_Y_03_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_03_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_03_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_03_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_03_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_03_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_03_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_03_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_03_PRE_POS))

/* 0x07C : awb3_config_31 */
#define DSP2_MIDDLE5_AWB3_CONFIG_31_OFFSET (0x07C)
#define DSP2_MIDDLE5_AWB3_WT_Y_04_PRE      DSP2_MIDDLE5_AWB3_WT_Y_04_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_04_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_04_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_04_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_04_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_04_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_04_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_04_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_04_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_05_PRE      DSP2_MIDDLE5_AWB3_WT_Y_05_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_05_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_05_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_05_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_05_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_05_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_05_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_05_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_05_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_06_PRE      DSP2_MIDDLE5_AWB3_WT_Y_06_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_06_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_06_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_06_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_06_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_06_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_06_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_06_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_06_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_07_PRE      DSP2_MIDDLE5_AWB3_WT_Y_07_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_07_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_07_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_07_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_07_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_07_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_07_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_07_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_07_PRE_POS))

/* 0x080 : awb3_config_32 */
#define DSP2_MIDDLE5_AWB3_CONFIG_32_OFFSET (0x080)
#define DSP2_MIDDLE5_AWB3_WT_Y_08_PRE      DSP2_MIDDLE5_AWB3_WT_Y_08_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_08_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_08_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_08_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_08_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_08_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_08_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_08_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_08_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_10_PRE      DSP2_MIDDLE5_AWB3_WT_Y_10_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_10_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_10_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_10_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_10_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_10_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_10_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_10_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_10_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_11_PRE      DSP2_MIDDLE5_AWB3_WT_Y_11_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_11_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_11_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_11_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_11_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_11_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_11_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_11_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_11_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_12_PRE      DSP2_MIDDLE5_AWB3_WT_Y_12_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_12_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_12_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_12_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_12_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_12_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_12_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_12_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_12_PRE_POS))

/* 0x084 : awb3_config_33 */
#define DSP2_MIDDLE5_AWB3_CONFIG_33_OFFSET (0x084)
#define DSP2_MIDDLE5_AWB3_WT_Y_13_PRE      DSP2_MIDDLE5_AWB3_WT_Y_13_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_13_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_13_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_13_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_13_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_13_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_13_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_13_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_13_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_14_PRE      DSP2_MIDDLE5_AWB3_WT_Y_14_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_14_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_14_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_14_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_14_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_14_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_14_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_14_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_14_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_15_PRE      DSP2_MIDDLE5_AWB3_WT_Y_15_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_15_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_15_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_15_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_15_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_15_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_15_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_15_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_15_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_16_PRE      DSP2_MIDDLE5_AWB3_WT_Y_16_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_16_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_16_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_16_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_16_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_16_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_16_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_16_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_16_PRE_POS))

/* 0x088 : awb3_config_34 */
#define DSP2_MIDDLE5_AWB3_CONFIG_34_OFFSET (0x088)
#define DSP2_MIDDLE5_AWB3_WT_Y_17_PRE      DSP2_MIDDLE5_AWB3_WT_Y_17_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_17_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_17_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_17_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_17_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_17_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_17_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_17_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_17_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_18_PRE      DSP2_MIDDLE5_AWB3_WT_Y_18_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_18_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_18_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_18_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_18_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_18_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_18_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_18_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_18_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_20_PRE      DSP2_MIDDLE5_AWB3_WT_Y_20_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_20_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_20_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_20_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_20_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_20_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_20_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_20_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_20_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_21_PRE      DSP2_MIDDLE5_AWB3_WT_Y_21_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_21_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_21_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_21_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_21_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_21_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_21_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_21_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_21_PRE_POS))

