RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x08C : awb3_config_35 */
#define DSP2_MIDDLE5_AWB3_CONFIG_35_OFFSET (0x08C)
#define DSP2_MIDDLE5_AWB3_WT_Y_22_PRE      DSP2_MIDDLE5_AWB3_WT_Y_22_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_22_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_22_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_22_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_22_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_22_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_22_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_22_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_22_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_23_PRE      DSP2_MIDDLE5_AWB3_WT_Y_23_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_23_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_23_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_23_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_23_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_23_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_23_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_23_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_23_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_24_PRE      DSP2_MIDDLE5_AWB3_WT_Y_24_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_24_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_24_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_24_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_24_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_24_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_24_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_24_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_24_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_25_PRE      DSP2_MIDDLE5_AWB3_WT_Y_25_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_25_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_25_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_25_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_25_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_25_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_25_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_25_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_25_PRE_POS))

/* 0x090 : awb3_config_36 */
#define DSP2_MIDDLE5_AWB3_CONFIG_36_OFFSET (0x090)
#define DSP2_MIDDLE5_AWB3_WT_Y_26_PRE      DSP2_MIDDLE5_AWB3_WT_Y_26_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_26_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_26_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_26_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_26_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_26_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_26_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_26_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_26_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_27_PRE      DSP2_MIDDLE5_AWB3_WT_Y_27_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_27_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_27_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_27_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_27_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_27_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_27_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_27_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_27_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_28_PRE      DSP2_MIDDLE5_AWB3_WT_Y_28_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_28_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_28_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_28_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_28_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_28_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_28_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_28_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_28_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_30_PRE      DSP2_MIDDLE5_AWB3_WT_Y_30_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_30_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_30_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_30_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_30_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_30_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_30_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_30_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_30_PRE_POS))

/* 0x094 : awb3_config_37 */
#define DSP2_MIDDLE5_AWB3_CONFIG_37_OFFSET (0x094)
#define DSP2_MIDDLE5_AWB3_WT_Y_31_PRE      DSP2_MIDDLE5_AWB3_WT_Y_31_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_31_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_31_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_31_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_31_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_31_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_31_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_31_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_31_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_32_PRE      DSP2_MIDDLE5_AWB3_WT_Y_32_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_32_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_32_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_32_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_32_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_32_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_32_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_32_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_32_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_33_PRE      DSP2_MIDDLE5_AWB3_WT_Y_33_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_33_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_33_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_33_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_33_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_33_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_33_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_33_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_33_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_34_PRE      DSP2_MIDDLE5_AWB3_WT_Y_34_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_34_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_34_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_34_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_34_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_34_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_34_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_34_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_34_PRE_POS))

/* 0x098 : awb3_config_38 */
#define DSP2_MIDDLE5_AWB3_CONFIG_38_OFFSET (0x098)
#define DSP2_MIDDLE5_AWB3_WT_Y_35_PRE      DSP2_MIDDLE5_AWB3_WT_Y_35_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_35_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_35_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_35_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_35_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_35_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_35_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_35_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_35_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_36_PRE      DSP2_MIDDLE5_AWB3_WT_Y_36_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_36_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_36_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_36_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_36_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_36_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_36_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_36_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_36_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_37_PRE      DSP2_MIDDLE5_AWB3_WT_Y_37_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_37_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_37_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_37_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_37_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_37_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_37_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_37_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_37_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_38_PRE      DSP2_MIDDLE5_AWB3_WT_Y_38_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_38_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_38_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_38_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_38_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_38_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_38_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_38_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_38_PRE_POS))

