RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x09C : awb3_config_39 */
#define DSP2_MIDDLE5_AWB3_CONFIG_39_OFFSET (0x09C)
#define DSP2_MIDDLE5_AWB3_WT_Y_40_PRE      DSP2_MIDDLE5_AWB3_WT_Y_40_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_40_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_40_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_40_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_40_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_40_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_40_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_40_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_40_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_41_PRE      DSP2_MIDDLE5_AWB3_WT_Y_41_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_41_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_41_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_41_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_41_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_41_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_41_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_41_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_41_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_42_PRE      DSP2_MIDDLE5_AWB3_WT_Y_42_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_42_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_42_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_42_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_42_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_42_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_42_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_42_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_42_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_43_PRE      DSP2_MIDDLE5_AWB3_WT_Y_43_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_43_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_43_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_43_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_43_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_43_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_43_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_43_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_43_PRE_POS))

/* 0x0A0 : awb3_config_40 */
#define DSP2_MIDDLE5_AWB3_CONFIG_40_OFFSET (0x0A0)
#define DSP2_MIDDLE5_AWB3_WT_Y_44_PRE      DSP2_MIDDLE5_AWB3_WT_Y_44_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_44_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_44_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_44_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_44_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_44_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_44_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_44_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_44_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_45_PRE      DSP2_MIDDLE5_AWB3_WT_Y_45_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_45_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_45_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_45_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_45_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_45_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_45_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_45_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_45_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_46_PRE      DSP2_MIDDLE5_AWB3_WT_Y_46_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_46_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_46_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_46_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_46_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_46_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_46_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_46_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_46_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_47_PRE      DSP2_MIDDLE5_AWB3_WT_Y_47_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_47_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_47_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_47_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_47_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_47_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_47_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_47_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_47_PRE_POS))

/* 0x0A4 : awb3_config_41 */
#define DSP2_MIDDLE5_AWB3_CONFIG_41_OFFSET (0x0A4)
#define DSP2_MIDDLE5_AWB3_WT_Y_48_PRE      DSP2_MIDDLE5_AWB3_WT_Y_48_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_48_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_48_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_48_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_48_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_48_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_48_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_48_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_48_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_50_PRE      DSP2_MIDDLE5_AWB3_WT_Y_50_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_50_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_50_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_50_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_50_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_50_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_50_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_50_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_50_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_51_PRE      DSP2_MIDDLE5_AWB3_WT_Y_51_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_51_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_51_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_51_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_51_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_51_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_51_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_51_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_51_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_52_PRE      DSP2_MIDDLE5_AWB3_WT_Y_52_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_52_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_52_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_52_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_52_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_52_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_52_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_52_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_52_PRE_POS))

/* 0x0A8 : awb3_config_42 */
#define DSP2_MIDDLE5_AWB3_CONFIG_42_OFFSET (0x0A8)
#define DSP2_MIDDLE5_AWB3_WT_Y_53_PRE      DSP2_MIDDLE5_AWB3_WT_Y_53_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_53_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_53_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_53_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_53_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_53_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_53_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_53_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_53_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_54_PRE      DSP2_MIDDLE5_AWB3_WT_Y_54_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_54_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_54_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_54_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_54_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_54_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_54_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_54_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_54_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_55_PRE      DSP2_MIDDLE5_AWB3_WT_Y_55_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_55_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_55_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_55_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_55_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_55_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_55_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_55_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_55_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_56_PRE      DSP2_MIDDLE5_AWB3_WT_Y_56_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_56_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_56_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_56_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_56_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_56_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_56_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_56_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_56_PRE_POS))

/* 0x0AC : awb3_config_43 */
#define DSP2_MIDDLE5_AWB3_CONFIG_43_OFFSET (0x0AC)
#define DSP2_MIDDLE5_AWB3_WT_Y_57_PRE      DSP2_MIDDLE5_AWB3_WT_Y_57_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_57_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_57_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_57_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_57_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_57_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_57_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_57_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_57_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_58_PRE      DSP2_MIDDLE5_AWB3_WT_Y_58_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_58_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_58_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_58_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_58_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_58_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_58_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_58_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_58_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_60_PRE      DSP2_MIDDLE5_AWB3_WT_Y_60_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_60_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_60_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_60_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_60_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_60_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_60_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_60_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_60_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_61_PRE      DSP2_MIDDLE5_AWB3_WT_Y_61_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_61_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_61_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_61_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_61_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_61_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_61_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_61_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_61_PRE_POS))

/* 0x0B0 : awb3_config_44 */
#define DSP2_MIDDLE5_AWB3_CONFIG_44_OFFSET (0x0B0)
#define DSP2_MIDDLE5_AWB3_WT_Y_62_PRE      DSP2_MIDDLE5_AWB3_WT_Y_62_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_62_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_62_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_62_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_62_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_62_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_62_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_62_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_62_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_63_PRE      DSP2_MIDDLE5_AWB3_WT_Y_63_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_63_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_63_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_63_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_63_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_63_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_63_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_63_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_63_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_64_PRE      DSP2_MIDDLE5_AWB3_WT_Y_64_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_64_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_64_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_64_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_64_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_64_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_64_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_64_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_64_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_65_PRE      DSP2_MIDDLE5_AWB3_WT_Y_65_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_65_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_65_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_65_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_65_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_65_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_65_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_65_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_65_PRE_POS))

