RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x0B4 : awb3_config_45 */
#define DSP2_MIDDLE5_AWB3_CONFIG_45_OFFSET (0x0B4)
#define DSP2_MIDDLE5_AWB3_WT_Y_66_PRE      DSP2_MIDDLE5_AWB3_WT_Y_66_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_66_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_66_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_66_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_66_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_66_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_66_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_66_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_66_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_67_PRE      DSP2_MIDDLE5_AWB3_WT_Y_67_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_67_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_67_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_67_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_67_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_67_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_67_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_67_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_67_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_68_PRE      DSP2_MIDDLE5_AWB3_WT_Y_68_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_68_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_68_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_68_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_68_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_68_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_68_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_68_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_68_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_70_PRE      DSP2_MIDDLE5_AWB3_WT_Y_70_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_70_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_70_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_70_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_70_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_70_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_70_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_70_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_70_PRE_POS))

/* 0x0B8 : awb3_config_46 */
#define DSP2_MIDDLE5_AWB3_CONFIG_46_OFFSET (0x0B8)
#define DSP2_MIDDLE5_AWB3_WT_Y_71_PRE      DSP2_MIDDLE5_AWB3_WT_Y_71_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_71_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_71_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_71_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_71_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_71_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_71_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_71_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_71_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_72_PRE      DSP2_MIDDLE5_AWB3_WT_Y_72_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_72_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_72_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_72_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_72_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_72_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_72_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_72_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_72_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_73_PRE      DSP2_MIDDLE5_AWB3_WT_Y_73_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_73_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_73_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_73_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_73_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_73_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_73_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_73_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_73_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_74_PRE      DSP2_MIDDLE5_AWB3_WT_Y_74_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_74_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_74_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_74_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_74_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_74_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_74_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_74_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_74_PRE_POS))

/* 0x0BC : awb3_config_47 */
#define DSP2_MIDDLE5_AWB3_CONFIG_47_OFFSET (0x0BC)
#define DSP2_MIDDLE5_AWB3_WT_Y_75_PRE      DSP2_MIDDLE5_AWB3_WT_Y_75_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_75_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_75_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_75_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_75_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_75_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_75_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_75_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_75_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_76_PRE      DSP2_MIDDLE5_AWB3_WT_Y_76_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_76_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_76_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_76_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_76_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_76_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_76_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_76_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_76_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_77_PRE      DSP2_MIDDLE5_AWB3_WT_Y_77_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_77_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_77_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_77_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_77_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_77_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_77_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_77_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_77_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_78_PRE      DSP2_MIDDLE5_AWB3_WT_Y_78_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_78_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_78_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_78_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_78_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_78_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_78_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_78_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_78_PRE_POS))

/* 0x0C0 : awb3_config_48 */
#define DSP2_MIDDLE5_AWB3_CONFIG_48_OFFSET (0x0C0)
#define DSP2_MIDDLE5_AWB3_WT_Y_80_PRE      DSP2_MIDDLE5_AWB3_WT_Y_80_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_80_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_80_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_80_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_80_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_80_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_80_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_80_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_80_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_81_PRE      DSP2_MIDDLE5_AWB3_WT_Y_81_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_81_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_81_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_81_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_81_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_81_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_81_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_81_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_81_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_82_PRE      DSP2_MIDDLE5_AWB3_WT_Y_82_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_82_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_82_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_82_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_82_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_82_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_82_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_82_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_82_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_83_PRE      DSP2_MIDDLE5_AWB3_WT_Y_83_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_83_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_83_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_83_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_83_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_83_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_83_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_83_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_83_PRE_POS))

