RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x0C4 : awb3_config_49 */
#define DSP2_MIDDLE5_AWB3_CONFIG_49_OFFSET (0x0C4)
#define DSP2_MIDDLE5_AWB3_WT_Y_84_PRE      DSP2_MIDDLE5_AWB3_WT_Y_84_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_84_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_84_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_84_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_84_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_84_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_84_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_84_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_84_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_85_PRE      DSP2_MIDDLE5_AWB3_WT_Y_85_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_85_PRE_POS  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_85_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_85_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_85_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_85_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_85_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_85_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_85_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_86_PRE      DSP2_MIDDLE5_AWB3_WT_Y_86_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_86_PRE_POS  (16U)
#define DSP2_MIDDLE5_AWB3_WT_Y_86_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_86_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_86_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_86_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_86_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_86_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_86_PRE_POS))
#define DSP2_MIDDLE5_AWB3_WT_Y_87_PRE      DSP2_MIDDLE5_AWB3_WT_Y_87_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_87_PRE_POS  (24U)
#define DSP2_MIDDLE5_AWB3_WT_Y_87_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_87_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_87_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_87_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_87_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_87_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_87_PRE_POS))

/* 0x0C8 : awb3_config_50 */
#define DSP2_MIDDLE5_AWB3_CONFIG_50_OFFSET (0x0C8)
#define DSP2_MIDDLE5_AWB3_WT_Y_88_PRE      DSP2_MIDDLE5_AWB3_WT_Y_88_PRE
#define DSP2_MIDDLE5_AWB3_WT_Y_88_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_Y_88_PRE_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_WT_Y_88_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_Y_88_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_88_PRE_POS)
#define DSP2_MIDDLE5_AWB3_WT_Y_88_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_Y_88_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_Y_88_PRE_POS))

/* 0x0CC : awb3_config_51 */
#define DSP2_MIDDLE5_AWB3_CONFIG_51_OFFSET         (0x0CC)
#define DSP2_MIDDLE5_AWB3_BIN_MODE_PRE             DSP2_MIDDLE5_AWB3_BIN_MODE_PRE
#define DSP2_MIDDLE5_AWB3_BIN_MODE_PRE_POS         (0U)
#define DSP2_MIDDLE5_AWB3_BIN_MODE_PRE_LEN         (2U)
#define DSP2_MIDDLE5_AWB3_BIN_MODE_PRE_MSK         (((1U << DSP2_MIDDLE5_AWB3_BIN_MODE_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_MODE_PRE_POS)
#define DSP2_MIDDLE5_AWB3_BIN_MODE_PRE_UMSK        (~(((1U << DSP2_MIDDLE5_AWB3_BIN_MODE_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_MODE_PRE_POS))
#define DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE       DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE
#define DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE_POS   (2U)
#define DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE_LEN   (20U)
#define DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE_MSK   (((1U << DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE_POS)
#define DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE_UMSK  (~(((1U << DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_PIXEL_CLIP_PRE_POS))
#define DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE          DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE
#define DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE_POS      (22U)
#define DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE_LEN      (1U)
#define DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE_MSK      (((1U << DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE_UMSK     (~(((1U << DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_CLIP_EN_PRE_POS))
#define DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE      DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE
#define DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE_POS  (23U)
#define DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE_LEN  (3U)
#define DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE_POS)
#define DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_RATIO_LEVEL_PRE_POS))
#define DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE          DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE
#define DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE_POS      (26U)
#define DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE_LEN      (3U)
#define DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE_MSK      (((1U << DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE_POS)
#define DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE_UMSK     (~(((1U << DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_BIN_Y_LEVEL_PRE_POS))
#define DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE         DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE
#define DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE_POS     (29U)
#define DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE_LEN     (1U)
#define DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE_MSK     (((1U << DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE_POS)
#define DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE_UMSK    (~(((1U << DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_HIST_Y_USE_G_PRE_POS))
#define DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE        DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE
#define DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE_POS    (30U)
#define DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE_LEN    (1U)
#define DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE_MSK    (((1U << DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE_POS)
#define DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE_UMSK   (~(((1U << DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_COUNT_ZERO_WT_PRE_POS))

/* 0x0D0 : awb3_config_52 */
#define DSP2_MIDDLE5_AWB3_CONFIG_52_OFFSET  (0x0D0)
#define DSP2_MIDDLE5_AWB3_INK_GAIN_PRE      DSP2_MIDDLE5_AWB3_INK_GAIN_PRE
#define DSP2_MIDDLE5_AWB3_INK_GAIN_PRE_POS  (0U)
#define DSP2_MIDDLE5_AWB3_INK_GAIN_PRE_LEN  (4U)
#define DSP2_MIDDLE5_AWB3_INK_GAIN_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_INK_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_INK_GAIN_PRE_POS)
#define DSP2_MIDDLE5_AWB3_INK_GAIN_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_INK_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_INK_GAIN_PRE_POS))
#define DSP2_MIDDLE5_AWB3_INK_TYPE_PRE      DSP2_MIDDLE5_AWB3_INK_TYPE_PRE
#define DSP2_MIDDLE5_AWB3_INK_TYPE_PRE_POS  (4U)
#define DSP2_MIDDLE5_AWB3_INK_TYPE_PRE_LEN  (2U)
#define DSP2_MIDDLE5_AWB3_INK_TYPE_PRE_MSK  (((1U << DSP2_MIDDLE5_AWB3_INK_TYPE_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_INK_TYPE_PRE_POS)
#define DSP2_MIDDLE5_AWB3_INK_TYPE_PRE_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_INK_TYPE_PRE_LEN) - 1) << DSP2_MIDDLE5_AWB3_INK_TYPE_PRE_POS))

