RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x0D4 : awb3_sta_0 */
#define DSP2_MIDDLE5_AWB3_STA_0_OFFSET  (0x0D4)
#define DSP2_MIDDLE5_AWB3_R_SUM0_R      DSP2_MIDDLE5_AWB3_R_SUM0_R
#define DSP2_MIDDLE5_AWB3_R_SUM0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_SUM0_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_SUM0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_SUM0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_SUM0_R_POS)
#define DSP2_MIDDLE5_AWB3_R_SUM0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_SUM0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_SUM0_R_POS))

/* 0x0D8 : awb3_sta_1 */
#define DSP2_MIDDLE5_AWB3_STA_1_OFFSET  (0x0D8)
#define DSP2_MIDDLE5_AWB3_G_SUM0_R      DSP2_MIDDLE5_AWB3_G_SUM0_R
#define DSP2_MIDDLE5_AWB3_G_SUM0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_G_SUM0_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_G_SUM0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_G_SUM0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_SUM0_R_POS)
#define DSP2_MIDDLE5_AWB3_G_SUM0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_G_SUM0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_SUM0_R_POS))

/* 0x0DC : awb3_sta_2 */
#define DSP2_MIDDLE5_AWB3_STA_2_OFFSET  (0x0DC)
#define DSP2_MIDDLE5_AWB3_B_SUM0_R      DSP2_MIDDLE5_AWB3_B_SUM0_R
#define DSP2_MIDDLE5_AWB3_B_SUM0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_SUM0_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_SUM0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_SUM0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_SUM0_R_POS)
#define DSP2_MIDDLE5_AWB3_B_SUM0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_SUM0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_SUM0_R_POS))

/* 0x0E0 : awb3_sta_3 */
#define DSP2_MIDDLE5_AWB3_STA_3_OFFSET      (0x0E0)
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R      DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R_POS)
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_SUM_HEX0_R_POS))

/* 0x0E4 : awb3_sta_4 */
#define DSP2_MIDDLE5_AWB3_STA_4_OFFSET      (0x0E4)
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R      DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R_POS)
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_SUM_HEX0_R_POS))

/* 0x0E8 : awb3_sta_5 */
#define DSP2_MIDDLE5_AWB3_STA_5_OFFSET      (0x0E8)
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R      DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R_POS)
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_SUM_HEX0_R_POS))

/* 0x0EC : awb3_sta_6 */
#define DSP2_MIDDLE5_AWB3_STA_6_OFFSET      (0x0EC)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R      DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R_LEN  (20U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R_POS)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HEX0_R_POS))

/* 0x0F0 : awb3_sta_7 */
#define DSP2_MIDDLE5_AWB3_STA_7_OFFSET           (0x0F0)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R      DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0U_R_POS))

/* 0x0F4 : awb3_sta_8 */
#define DSP2_MIDDLE5_AWB3_STA_8_OFFSET           (0x0F4)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R      DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y0L_R_POS))

/* 0x0F8 : awb3_sta_9 */
#define DSP2_MIDDLE5_AWB3_STA_9_OFFSET           (0x0F8)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R      DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0U_R_POS))

/* 0x0FC : awb3_sta_10 */
#define DSP2_MIDDLE5_AWB3_STA_10_OFFSET          (0x0FC)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R      DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y0L_R_POS))

/* 0x100 : awb3_sta_11 */
#define DSP2_MIDDLE5_AWB3_STA_11_OFFSET    (0x100)
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R      DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R_LEN  (28U)
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R_POS)
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HEX_Y0_R_POS))

/* 0x104 : awb3_sta_12 */
#define DSP2_MIDDLE5_AWB3_STA_12_OFFSET       (0x104)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R      DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R_LEN  (20U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R_POS)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y0_R_POS))

/* 0x108 : awb3_sta_13 */
#define DSP2_MIDDLE5_AWB3_STA_13_OFFSET         (0x108)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R      DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST0U_R_POS))

/* 0x10C : awb3_sta_14 */
#define DSP2_MIDDLE5_AWB3_STA_14_OFFSET         (0x10C)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R      DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST0L_R_POS))

/* 0x110 : awb3_sta_15 */
#define DSP2_MIDDLE5_AWB3_STA_15_OFFSET         (0x110)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R      DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST0U_R_POS))

/* 0x114 : awb3_sta_16 */
#define DSP2_MIDDLE5_AWB3_STA_16_OFFSET         (0x114)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R      DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST0L_R_POS))

/* 0x118 : awb3_sta_17 */
#define DSP2_MIDDLE5_AWB3_STA_17_OFFSET   (0x118)
#define DSP2_MIDDLE5_AWB3_WT_HIST0_R      DSP2_MIDDLE5_AWB3_WT_HIST0_R
#define DSP2_MIDDLE5_AWB3_WT_HIST0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_HIST0_R_LEN  (28U)
#define DSP2_MIDDLE5_AWB3_WT_HIST0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_HIST0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HIST0_R_POS)
#define DSP2_MIDDLE5_AWB3_WT_HIST0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_HIST0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HIST0_R_POS))

/* 0x11C : awb3_sta_18 */
#define DSP2_MIDDLE5_AWB3_STA_18_OFFSET      (0x11C)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R      DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R_LEN  (20U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R_POS)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HIST0_R_POS))

/* 0x120 : awb3_sta_19 */
#define DSP2_MIDDLE5_AWB3_STA_19_OFFSET              (0x120)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R      DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0U_R_POS))

/* 0x124 : awb3_sta_20 */
#define DSP2_MIDDLE5_AWB3_STA_20_OFFSET              (0x124)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R      DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP0L_R_POS))

