RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x128 : awb3_sta_21 */
#define DSP2_MIDDLE5_AWB3_STA_21_OFFSET              (0x128)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R      DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0U_R_POS))

/* 0x12C : awb3_sta_22 */
#define DSP2_MIDDLE5_AWB3_STA_22_OFFSET              (0x12C)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R      DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP0L_R_POS))

/* 0x130 : awb3_sta_23 */
#define DSP2_MIDDLE5_AWB3_STA_23_OFFSET        (0x130)
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R      DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R_LEN  (28U)
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R_POS)
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HIST_CLIP0_R_POS))

/* 0x134 : awb3_sta_24 */
#define DSP2_MIDDLE5_AWB3_STA_24_OFFSET           (0x134)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R      DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R_LEN  (20U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R_POS)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP0_R_POS))

/* 0x138 : awb3_sta_25 */
#define DSP2_MIDDLE5_AWB3_STA_25_OFFSET (0x138)
#define DSP2_MIDDLE5_AWB3_R_SUM1_R      DSP2_MIDDLE5_AWB3_R_SUM1_R
#define DSP2_MIDDLE5_AWB3_R_SUM1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_SUM1_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_SUM1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_SUM1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_SUM1_R_POS)
#define DSP2_MIDDLE5_AWB3_R_SUM1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_SUM1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_SUM1_R_POS))

/* 0x13C : awb3_sta_26 */
#define DSP2_MIDDLE5_AWB3_STA_26_OFFSET (0x13C)
#define DSP2_MIDDLE5_AWB3_G_SUM1_R      DSP2_MIDDLE5_AWB3_G_SUM1_R
#define DSP2_MIDDLE5_AWB3_G_SUM1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_G_SUM1_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_G_SUM1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_G_SUM1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_SUM1_R_POS)
#define DSP2_MIDDLE5_AWB3_G_SUM1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_G_SUM1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_SUM1_R_POS))

/* 0x140 : awb3_sta_27 */
#define DSP2_MIDDLE5_AWB3_STA_27_OFFSET (0x140)
#define DSP2_MIDDLE5_AWB3_B_SUM1_R      DSP2_MIDDLE5_AWB3_B_SUM1_R
#define DSP2_MIDDLE5_AWB3_B_SUM1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_SUM1_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_SUM1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_SUM1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_SUM1_R_POS)
#define DSP2_MIDDLE5_AWB3_B_SUM1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_SUM1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_SUM1_R_POS))

/* 0x144 : awb3_sta_28 */
#define DSP2_MIDDLE5_AWB3_STA_28_OFFSET     (0x144)
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R      DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R_POS)
#define DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_SUM_HEX1_R_POS))

/* 0x148 : awb3_sta_29 */
#define DSP2_MIDDLE5_AWB3_STA_29_OFFSET     (0x148)
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R      DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R_POS)
#define DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_G_SUM_HEX1_R_POS))

/* 0x14C : awb3_sta_30 */
#define DSP2_MIDDLE5_AWB3_STA_30_OFFSET     (0x14C)
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R      DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R_POS)
#define DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_SUM_HEX1_R_POS))

/* 0x150 : awb3_sta_31 */
#define DSP2_MIDDLE5_AWB3_STA_31_OFFSET     (0x150)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R      DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R_LEN  (20U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R_POS)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HEX1_R_POS))

/* 0x154 : awb3_sta_32 */
#define DSP2_MIDDLE5_AWB3_STA_32_OFFSET          (0x154)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R      DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1U_R_POS))

