RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x158 : awb3_sta_33 */
#define DSP2_MIDDLE5_AWB3_STA_33_OFFSET          (0x158)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R      DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HEX_Y1L_R_POS))

/* 0x15C : awb3_sta_34 */
#define DSP2_MIDDLE5_AWB3_STA_34_OFFSET          (0x15C)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R      DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1U_R_POS))

/* 0x160 : awb3_sta_35 */
#define DSP2_MIDDLE5_AWB3_STA_35_OFFSET          (0x160)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R      DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HEX_Y1L_R_POS))

/* 0x164 : awb3_sta_36 */
#define DSP2_MIDDLE5_AWB3_STA_36_OFFSET    (0x164)
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R      DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R_LEN  (28U)
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R_POS)
#define DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HEX_Y1_R_POS))

/* 0x168 : awb3_sta_37 */
#define DSP2_MIDDLE5_AWB3_STA_37_OFFSET       (0x168)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R      DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R_LEN  (20U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R_POS)
#define DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HEX_Y1_R_POS))

/* 0x16C : awb3_sta_38 */
#define DSP2_MIDDLE5_AWB3_STA_38_OFFSET         (0x16C)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R      DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST1U_R_POS))

/* 0x170 : awb3_sta_39 */
#define DSP2_MIDDLE5_AWB3_STA_39_OFFSET         (0x170)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R      DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST1L_R_POS))

/* 0x174 : awb3_sta_40 */
#define DSP2_MIDDLE5_AWB3_STA_40_OFFSET         (0x174)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R      DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST1U_R_POS))

/* 0x178 : awb3_sta_41 */
#define DSP2_MIDDLE5_AWB3_STA_41_OFFSET         (0x178)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R      DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST1L_R_POS))

/* 0x17C : awb3_sta_42 */
#define DSP2_MIDDLE5_AWB3_STA_42_OFFSET   (0x17C)
#define DSP2_MIDDLE5_AWB3_WT_HIST1_R      DSP2_MIDDLE5_AWB3_WT_HIST1_R
#define DSP2_MIDDLE5_AWB3_WT_HIST1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_HIST1_R_LEN  (28U)
#define DSP2_MIDDLE5_AWB3_WT_HIST1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_HIST1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HIST1_R_POS)
#define DSP2_MIDDLE5_AWB3_WT_HIST1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_HIST1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HIST1_R_POS))

/* 0x180 : awb3_sta_43 */
#define DSP2_MIDDLE5_AWB3_STA_43_OFFSET      (0x180)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R      DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R_LEN  (20U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R_POS)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HIST1_R_POS))

