RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
/* 0x184 : awb3_sta_44 */
#define DSP2_MIDDLE5_AWB3_STA_44_OFFSET              (0x184)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R      DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R_LEN  (8U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1U_R_POS))

/* 0x188 : awb3_sta_45 */
#define DSP2_MIDDLE5_AWB3_STA_45_OFFSET              (0x188)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R      DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R_POS)
#define DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_R_RATIO_HIST_CLIP1L_R_POS))

/* 0x18C : awb3_sta_46 */
#define DSP2_MIDDLE5_AWB3_STA_46_OFFSET              (0x18C)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R      DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R_LEN  (17U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1U_R_POS))

/* 0x190 : awb3_sta_47 */
#define DSP2_MIDDLE5_AWB3_STA_47_OFFSET              (0x190)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R      DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R_LEN  (32U)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R_POS)
#define DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_B_RATIO_HIST_CLIP1L_R_POS))

/* 0x194 : awb3_sta_48 */
#define DSP2_MIDDLE5_AWB3_STA_48_OFFSET        (0x194)
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R      DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R_LEN  (28U)
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R_POS)
#define DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_WT_HIST_CLIP1_R_POS))

/* 0x198 : awb3_sta_49 */
#define DSP2_MIDDLE5_AWB3_STA_49_OFFSET           (0x198)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R      DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R_POS  (0U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R_LEN  (20U)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R_MSK  (((1U << DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R_POS)
#define DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R_UMSK (~(((1U << DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_PIXEL_HIST_CLIP1_R_POS))

/* 0x19C : awb3_status_0 */
#define DSP2_MIDDLE5_AWB3_STATUS_0_OFFSET (0x19C)
#define DSP2_MIDDLE5_AWB3_W_CNT_R         DSP2_MIDDLE5_AWB3_W_CNT_R
#define DSP2_MIDDLE5_AWB3_W_CNT_R_POS     (0U)
#define DSP2_MIDDLE5_AWB3_W_CNT_R_LEN     (5U)
#define DSP2_MIDDLE5_AWB3_W_CNT_R_MSK     (((1U << DSP2_MIDDLE5_AWB3_W_CNT_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_W_CNT_R_POS)
#define DSP2_MIDDLE5_AWB3_W_CNT_R_UMSK    (~(((1U << DSP2_MIDDLE5_AWB3_W_CNT_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_W_CNT_R_POS))
#define DSP2_MIDDLE5_AWB3_BUF_IDX_R       DSP2_MIDDLE5_AWB3_BUF_IDX_R
#define DSP2_MIDDLE5_AWB3_BUF_IDX_R_POS   (8U)
#define DSP2_MIDDLE5_AWB3_BUF_IDX_R_LEN   (1U)
#define DSP2_MIDDLE5_AWB3_BUF_IDX_R_MSK   (((1U << DSP2_MIDDLE5_AWB3_BUF_IDX_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_BUF_IDX_R_POS)
#define DSP2_MIDDLE5_AWB3_BUF_IDX_R_UMSK  (~(((1U << DSP2_MIDDLE5_AWB3_BUF_IDX_R_LEN) - 1) << DSP2_MIDDLE5_AWB3_BUF_IDX_R_POS))

struct dsp2_middle5_reg {
    /* 0x000 : awb3_config_0 */
    union {
        struct {
            uint32_t awb3_stat_x_max_pre : 11; /* [10: 0],        r/w,      0x77f */
            uint32_t reserved_11_15      : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t awb3_stat_x_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_30      : 4;  /* [30:27],       rsvd,        0x0 */
            uint32_t awb3_stat_en_pre    : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_0;

    /* 0x004 : awb3_config_1 */
    union {
        struct {
            uint32_t awb3_stat_y_max_pre : 11; /* [10: 0],        r/w,      0x437 */
            uint32_t reserved_11_15      : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t awb3_stat_y_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31      : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_1;

    /* 0x008 : awb3_config_2 */
    union {
        struct {
            uint32_t awb3_b_ratio_ofst_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15        : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t awb3_r_ratio_ofst_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_30        : 3;  /* [30:28],       rsvd,        0x0 */
            uint32_t awb3_g_divisor_pre    : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_2;

    /* 0x00C : awb3_config_3 */
    union {
        struct {
            uint32_t awb3_b_ratio_mult_pre : 12; /* [11: 0],        r/w,      0x100 */
            uint32_t reserved_12_15        : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t awb3_r_ratio_mult_pre : 12; /* [27:16],        r/w,      0x100 */
            uint32_t reserved_28_31        : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_3;

    /* 0x010 : awb3_config_4 */
    union {
        struct {
            uint32_t awb3_ratio_sum_max_pre : 9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t awb3_ratio_sum_min_pre : 9; /* [17: 9],        r/w,        0x0 */
            uint32_t awb3_wt_ratio_gain_pre : 8; /* [25:18],        r/w,        0x0 */
            uint32_t awb3_wt_ratio_en_pre   : 1; /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31         : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_4;

    /* 0x014 : awb3_config_5 */
    union {
        struct {
            uint32_t awb3_wt_ratio_00_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_01_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_02_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_03_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_5;

    /* 0x018 : awb3_config_6 */
    union {
        struct {
            uint32_t awb3_wt_ratio_04_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_05_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_06_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_07_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_6;

    /* 0x01C : awb3_config_7 */
    union {
        struct {
            uint32_t awb3_wt_ratio_08_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_10_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_11_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_12_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_7;

    /* 0x020 : awb3_config_8 */
    union {
        struct {
            uint32_t awb3_wt_ratio_13_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_14_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_15_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_16_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_8;

    /* 0x024 : awb3_config_9 */
    union {
        struct {
            uint32_t awb3_wt_ratio_17_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_18_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_20_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_21_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_9;

    /* 0x028 : awb3_config_10 */
    union {
        struct {
            uint32_t awb3_wt_ratio_22_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_23_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_24_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_25_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_10;

    /* 0x02C : awb3_config_11 */
    union {
        struct {
            uint32_t awb3_wt_ratio_26_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_27_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_28_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_30_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_11;

    /* 0x030 : awb3_config_12 */
    union {
        struct {
            uint32_t awb3_wt_ratio_31_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_32_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_33_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_34_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_12;

    /* 0x034 : awb3_config_13 */
    union {
        struct {
            uint32_t awb3_wt_ratio_35_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_36_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_37_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_38_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_13;

    /* 0x038 : awb3_config_14 */
    union {
        struct {
            uint32_t awb3_wt_ratio_40_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_41_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_42_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_43_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_14;

