RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
    /* 0x03C : awb3_config_15 */
    union {
        struct {
            uint32_t awb3_wt_ratio_44_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_45_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_46_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_47_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_15;

    /* 0x040 : awb3_config_16 */
    union {
        struct {
            uint32_t awb3_wt_ratio_48_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_50_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_51_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_52_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_16;

    /* 0x044 : awb3_config_17 */
    union {
        struct {
            uint32_t awb3_wt_ratio_53_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_54_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_55_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_56_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_17;

    /* 0x048 : awb3_config_18 */
    union {
        struct {
            uint32_t awb3_wt_ratio_57_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_58_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_60_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_61_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_18;

    /* 0x04C : awb3_config_19 */
    union {
        struct {
            uint32_t awb3_wt_ratio_62_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_63_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_64_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_65_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_19;

    /* 0x050 : awb3_config_20 */
    union {
        struct {
            uint32_t awb3_wt_ratio_66_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_67_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_68_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_70_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_20;

    /* 0x054 : awb3_config_21 */
    union {
        struct {
            uint32_t awb3_wt_ratio_71_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_72_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_73_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_74_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_21;

    /* 0x058 : awb3_config_22 */
    union {
        struct {
            uint32_t awb3_wt_ratio_75_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_76_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_77_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_78_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_22;

    /* 0x05C : awb3_config_23 */
    union {
        struct {
            uint32_t awb3_wt_ratio_80_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_81_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_82_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_83_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_23;

    /* 0x060 : awb3_config_24 */
    union {
        struct {
            uint32_t awb3_wt_ratio_84_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_85_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_86_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_ratio_87_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_24;

    /* 0x064 : awb3_config_25 */
    union {
        struct {
            uint32_t awb3_wt_ratio_88_pre : 8;  /* [ 7: 0],        r/w,        0x1 */
            uint32_t reserved_8_31        : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_25;

    /* 0x068 : awb3_config_26 */
    union {
        struct {
            uint32_t awb3_y_r_coeff_pre : 12; /* [11: 0],        r/w,       0x4d */
            uint32_t reserved_12_31     : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_26;

    /* 0x06C : awb3_config_27 */
    union {
        struct {
            uint32_t awb3_y_g_coeff_pre : 12; /* [11: 0],        r/w,       0x96 */
            uint32_t reserved_12_31     : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_27;

    /* 0x070 : awb3_config_28 */
    union {
        struct {
            uint32_t awb3_y_b_coeff_pre : 12; /* [11: 0],        r/w,       0x1d */
            uint32_t reserved_12_31     : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_28;

    /* 0x074 : awb3_config_29 */
    union {
        struct {
            uint32_t awb3_wt_y_gain_pre  : 8;  /* [ 7: 0],        r/w,       0x10 */
            uint32_t awb3_wt_y_en_pre    : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11       : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t awb3_wt_y_use_g_pre : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31      : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_29;

    /* 0x078 : awb3_config_30 */
    union {
        struct {
            uint32_t awb3_wt_y_00_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_01_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_02_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_03_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_30;

    /* 0x07C : awb3_config_31 */
    union {
        struct {
            uint32_t awb3_wt_y_04_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_05_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_06_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_07_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_31;

    /* 0x080 : awb3_config_32 */
    union {
        struct {
            uint32_t awb3_wt_y_08_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_10_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_11_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_12_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_32;

    /* 0x084 : awb3_config_33 */
    union {
        struct {
            uint32_t awb3_wt_y_13_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_14_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_15_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_16_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_33;

    /* 0x088 : awb3_config_34 */
    union {
        struct {
            uint32_t awb3_wt_y_17_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_18_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_20_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_21_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_34;

