RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
    /* 0x08C : awb3_config_35 */
    union {
        struct {
            uint32_t awb3_wt_y_22_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_23_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_24_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_25_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_35;

    /* 0x090 : awb3_config_36 */
    union {
        struct {
            uint32_t awb3_wt_y_26_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_27_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_28_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_30_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_36;

    /* 0x094 : awb3_config_37 */
    union {
        struct {
            uint32_t awb3_wt_y_31_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_32_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_33_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_34_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_37;

    /* 0x098 : awb3_config_38 */
    union {
        struct {
            uint32_t awb3_wt_y_35_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_36_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_37_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_38_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_38;

    /* 0x09C : awb3_config_39 */
    union {
        struct {
            uint32_t awb3_wt_y_40_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_41_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_42_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_43_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_39;

    /* 0x0A0 : awb3_config_40 */
    union {
        struct {
            uint32_t awb3_wt_y_44_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_45_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_46_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_47_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_40;

    /* 0x0A4 : awb3_config_41 */
    union {
        struct {
            uint32_t awb3_wt_y_48_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_50_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_51_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_52_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_41;

    /* 0x0A8 : awb3_config_42 */
    union {
        struct {
            uint32_t awb3_wt_y_53_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_54_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_55_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_56_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_42;

    /* 0x0AC : awb3_config_43 */
    union {
        struct {
            uint32_t awb3_wt_y_57_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_58_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_60_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_61_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_43;

    /* 0x0B0 : awb3_config_44 */
    union {
        struct {
            uint32_t awb3_wt_y_62_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_63_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_64_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_65_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_44;

    /* 0x0B4 : awb3_config_45 */
    union {
        struct {
            uint32_t awb3_wt_y_66_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_67_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_68_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_70_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_45;

    /* 0x0B8 : awb3_config_46 */
    union {
        struct {
            uint32_t awb3_wt_y_71_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_72_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_73_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_74_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_46;

    /* 0x0BC : awb3_config_47 */
    union {
        struct {
            uint32_t awb3_wt_y_75_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_76_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_77_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_78_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_47;

    /* 0x0C0 : awb3_config_48 */
    union {
        struct {
            uint32_t awb3_wt_y_80_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_81_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_82_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_83_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_48;

