RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
    /* 0x0C4 : awb3_config_49 */
    union {
        struct {
            uint32_t awb3_wt_y_84_pre : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t awb3_wt_y_85_pre : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t awb3_wt_y_86_pre : 8; /* [23:16],        r/w,        0x1 */
            uint32_t awb3_wt_y_87_pre : 8; /* [31:24],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } awb3_config_49;

    /* 0x0C8 : awb3_config_50 */
    union {
        struct {
            uint32_t awb3_wt_y_88_pre : 8;  /* [ 7: 0],        r/w,        0x1 */
            uint32_t reserved_8_31    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_50;

    /* 0x0CC : awb3_config_51 */
    union {
        struct {
            uint32_t awb3_bin_mode_pre        : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t awb3_bin_pixel_clip_pre  : 20; /* [21: 2],        r/w,    0xfd200 */
            uint32_t awb3_bin_clip_en_pre     : 1;  /* [   22],        r/w,        0x0 */
            uint32_t awb3_bin_ratio_level_pre : 3;  /* [25:23],        r/w,        0x3 */
            uint32_t awb3_bin_y_level_pre     : 3;  /* [28:26],        r/w,        0x3 */
            uint32_t awb3_hist_y_use_g_pre    : 1;  /* [   29],        r/w,        0x0 */
            uint32_t awb3_count_zero_wt_pre   : 1;  /* [   30],        r/w,        0x0 */
            uint32_t reserved_31              : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_51;

    /* 0x0D0 : awb3_config_52 */
    union {
        struct {
            uint32_t awb3_ink_gain_pre : 4;  /* [ 3: 0],        r/w,        0x1 */
            uint32_t awb3_ink_type_pre : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_31     : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_config_52;

    /* 0x0D4 : awb3_sta_0 */
    union {
        struct {
            uint32_t awb3_r_sum0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_0;

    /* 0x0D8 : awb3_sta_1 */
    union {
        struct {
            uint32_t awb3_g_sum0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_1;

    /* 0x0DC : awb3_sta_2 */
    union {
        struct {
            uint32_t awb3_b_sum0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_2;

    /* 0x0E0 : awb3_sta_3 */
    union {
        struct {
            uint32_t awb3_r_sum_hex0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_3;

    /* 0x0E4 : awb3_sta_4 */
    union {
        struct {
            uint32_t awb3_g_sum_hex0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_4;

    /* 0x0E8 : awb3_sta_5 */
    union {
        struct {
            uint32_t awb3_b_sum_hex0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_5;

    /* 0x0EC : awb3_sta_6 */
    union {
        struct {
            uint32_t awb3_pixel_hex0_r : 20; /* [19: 0],          r,        0x0 */
            uint32_t reserved_20_31    : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_6;

    /* 0x0F0 : awb3_sta_7 */
    union {
        struct {
            uint32_t awb3_r_ratio_hex_y0u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31          : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_7;

    /* 0x0F4 : awb3_sta_8 */
    union {
        struct {
            uint32_t awb3_r_ratio_hex_y0l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_8;

    /* 0x0F8 : awb3_sta_9 */
    union {
        struct {
            uint32_t awb3_b_ratio_hex_y0u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31          : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_9;

    /* 0x0FC : awb3_sta_10 */
    union {
        struct {
            uint32_t awb3_b_ratio_hex_y0l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_10;

    /* 0x100 : awb3_sta_11 */
    union {
        struct {
            uint32_t awb3_wt_hex_y0_r : 28; /* [27: 0],          r,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_11;

    /* 0x104 : awb3_sta_12 */
    union {
        struct {
            uint32_t awb3_pixel_hex_y0_r : 20; /* [19: 0],          r,        0x0 */
            uint32_t reserved_20_31      : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_12;

    /* 0x108 : awb3_sta_13 */
    union {
        struct {
            uint32_t awb3_r_ratio_hist0u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_13;

    /* 0x10C : awb3_sta_14 */
    union {
        struct {
            uint32_t awb3_r_ratio_hist0l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_14;

    /* 0x110 : awb3_sta_15 */
    union {
        struct {
            uint32_t awb3_b_ratio_hist0u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_15;

    /* 0x114 : awb3_sta_16 */
    union {
        struct {
            uint32_t awb3_b_ratio_hist0l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_16;

    /* 0x118 : awb3_sta_17 */
    union {
        struct {
            uint32_t awb3_wt_hist0_r : 28; /* [27: 0],          r,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_17;

    /* 0x11C : awb3_sta_18 */
    union {
        struct {
            uint32_t awb3_pixel_hist0_r : 20; /* [19: 0],          r,        0x0 */
            uint32_t reserved_20_31     : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_18;

    /* 0x120 : awb3_sta_19 */
    union {
        struct {
            uint32_t awb3_r_ratio_hist_clip0u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31              : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_19;

    /* 0x124 : awb3_sta_20 */
    union {
        struct {
            uint32_t awb3_r_ratio_hist_clip0l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_20;

