RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle5_reg.h
    /* 0x128 : awb3_sta_21 */
    union {
        struct {
            uint32_t awb3_b_ratio_hist_clip0u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31              : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_21;

    /* 0x12C : awb3_sta_22 */
    union {
        struct {
            uint32_t awb3_b_ratio_hist_clip0l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_22;

    /* 0x130 : awb3_sta_23 */
    union {
        struct {
            uint32_t awb3_wt_hist_clip0_r : 28; /* [27: 0],          r,        0x0 */
            uint32_t reserved_28_31       : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_23;

    /* 0x134 : awb3_sta_24 */
    union {
        struct {
            uint32_t awb3_pixel_hist_clip0_r : 20; /* [19: 0],          r,        0x0 */
            uint32_t reserved_20_31          : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_24;

    /* 0x138 : awb3_sta_25 */
    union {
        struct {
            uint32_t awb3_r_sum1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_25;

    /* 0x13C : awb3_sta_26 */
    union {
        struct {
            uint32_t awb3_g_sum1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_26;

    /* 0x140 : awb3_sta_27 */
    union {
        struct {
            uint32_t awb3_b_sum1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_27;

    /* 0x144 : awb3_sta_28 */
    union {
        struct {
            uint32_t awb3_r_sum_hex1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_28;

    /* 0x148 : awb3_sta_29 */
    union {
        struct {
            uint32_t awb3_g_sum_hex1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_29;

    /* 0x14C : awb3_sta_30 */
    union {
        struct {
            uint32_t awb3_b_sum_hex1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_30;

    /* 0x150 : awb3_sta_31 */
    union {
        struct {
            uint32_t awb3_pixel_hex1_r : 20; /* [19: 0],          r,        0x0 */
            uint32_t reserved_20_31    : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_31;

    /* 0x154 : awb3_sta_32 */
    union {
        struct {
            uint32_t awb3_r_ratio_hex_y1u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31          : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_32;

    /* 0x158 : awb3_sta_33 */
    union {
        struct {
            uint32_t awb3_r_ratio_hex_y1l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_33;

    /* 0x15C : awb3_sta_34 */
    union {
        struct {
            uint32_t awb3_b_ratio_hex_y1u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31          : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_34;

    /* 0x160 : awb3_sta_35 */
    union {
        struct {
            uint32_t awb3_b_ratio_hex_y1l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_35;

    /* 0x164 : awb3_sta_36 */
    union {
        struct {
            uint32_t awb3_wt_hex_y1_r : 28; /* [27: 0],          r,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_36;

    /* 0x168 : awb3_sta_37 */
    union {
        struct {
            uint32_t awb3_pixel_hex_y1_r : 20; /* [19: 0],          r,        0x0 */
            uint32_t reserved_20_31      : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_37;

    /* 0x16C : awb3_sta_38 */
    union {
        struct {
            uint32_t awb3_r_ratio_hist1u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_38;

    /* 0x170 : awb3_sta_39 */
    union {
        struct {
            uint32_t awb3_r_ratio_hist1l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_39;

    /* 0x174 : awb3_sta_40 */
    union {
        struct {
            uint32_t awb3_b_ratio_hist1u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_40;

    /* 0x178 : awb3_sta_41 */
    union {
        struct {
            uint32_t awb3_b_ratio_hist1l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_41;

    /* 0x17C : awb3_sta_42 */
    union {
        struct {
            uint32_t awb3_wt_hist1_r : 28; /* [27: 0],          r,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_42;

    /* 0x180 : awb3_sta_43 */
    union {
        struct {
            uint32_t awb3_pixel_hist1_r : 20; /* [19: 0],          r,        0x0 */
            uint32_t reserved_20_31     : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_43;

    /* 0x184 : awb3_sta_44 */
    union {
        struct {
            uint32_t awb3_r_ratio_hist_clip1u_r : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31              : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_44;

    /* 0x188 : awb3_sta_45 */
    union {
        struct {
            uint32_t awb3_r_ratio_hist_clip1l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_45;

    /* 0x18C : awb3_sta_46 */
    union {
        struct {
            uint32_t awb3_b_ratio_hist_clip1u_r : 17; /* [16: 0],          r,        0x0 */
            uint32_t reserved_17_31             : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_46;

    /* 0x190 : awb3_sta_47 */
    union {
        struct {
            uint32_t awb3_b_ratio_hist_clip1l_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_47;

    /* 0x194 : awb3_sta_48 */
    union {
        struct {
            uint32_t awb3_wt_hist_clip1_r : 28; /* [27: 0],          r,        0x0 */
            uint32_t reserved_28_31       : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_48;

    /* 0x198 : awb3_sta_49 */
    union {
        struct {
            uint32_t awb3_pixel_hist_clip1_r : 20; /* [19: 0],          r,        0x0 */
            uint32_t reserved_20_31          : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_sta_49;

    /* 0x19C : awb3_status_0 */
    union {
        struct {
            uint32_t awb3_w_cnt_r   : 5;  /* [ 4: 0],          r,        0x0 */
            uint32_t reserved_5_7   : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t awb3_buf_idx_r : 1;  /* [    8],          r,        0x0 */
            uint32_t reserved_9_31  : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb3_status_0;
};

typedef volatile struct dsp2_middle5_reg dsp2_middle5_reg_t;

#endif /* __DSP2_MIDDLE5_REG_H__ */
